tutorials/multiform/oilWaxFoam/tjunction_orig/0/U.orig

/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet_additive
    {
        type            zeroGradient; 
        
    }

    outlet
    {
        type            zeroGradient;
    }

    inlet_oil
    {
        type          zeroGradient; 
        value         uniform (0.1 0 0);
    }

    warm_walls
    {
       type            noSlip;
    }

    cold_walls
    {
        type            noSlip;
    }
    empty
    {
        type            empty;
    }
}

// ************************************************************************* //
