tutorials/multiform/oilWaxFoam/tjunction_orig/0/psi.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
 inlet_additive
    {
        type             zeroGradient;
    }

    outlet
    {
        type             zeroGradient;
    }

    inlet_oil
    {
        type             zeroGradient;
    }

    warm_walls
    {
        type            zeroGradient;
    }

    cold_walls
    {
        type            zeroGradient;
    }
    empty
    {
        type            empty;
    }
}

